
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-ecs/actions/runs/5785888034)


<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.network.module.alb_sg.aws_security_group.this_name_prefix[0]
  * module.network.module.alb_sg.aws_security_group_rule.egress_with_source_security_group_id[0]
  * module.network.module.alb_sg.aws_security_group_rule.ingress_rules[0]
  * module.network.module.backend_sg.aws_security_group.this_name_prefix[0]
  * module.network.module.backend_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]
  * module.network.module.frontend_sg.aws_security_group.this_name_prefix[0]
  * module.network.module.frontend_sg.aws_security_group_rule.egress_with_source_security_group_id[0]
  * module.network.module.frontend_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.network.module.alb_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "ALB security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "dev-alb-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "dev-alb-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-alb-sg"
        }
      + vpc_id                 = "vpc-0c3686b889eed84c0"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.network.module.alb_sg.aws_security_group_rule.egress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "egress_with_source_security_group_id" {
      + description              = "Egress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.network.module.alb_sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.network.module.backend_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Backend security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "dev-backend-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "dev-backend-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-backend-sg"
        }
      + vpc_id                 = "vpc-0c3686b889eed84c0"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.network.module.backend_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Ingress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

  # module.network.module.frontend_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Frontend security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "dev-frontend-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "dev-frontend-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-frontend-sg"
        }
      + vpc_id                 = "vpc-0c3686b889eed84c0"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.network.module.frontend_sg.aws_security_group_rule.egress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "egress_with_source_security_group_id" {
      + description              = "Egress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.network.module.frontend_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Ingress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.network.module.network.aws_eip.nat,
  on .terraform/modules/network.network/main.tf line 1030, in resource "aws_eip" "nat":
1030:   vpc = true

use domain attribute instead

(and 2 more similar warnings elsewhere)

```



<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":31,"Program":"tfcmt","SHA1":"2bc24f0c357592d88f4f7cd2e0a58e1abbbd9bd5","Vars":{},"WorkflowName":"dev plan"} -->